[
    "Message a friend asking how they are doing.",
    "Connect with a family member by expressing a kind thought.",
    "Send a thank-you note to someone who has helped you recently.",
    "Cook a special dinner for your spouse.",
    "Spend quality time with your kids doing an activity they love.",
    "Help your parents with household chores.",
    "Organize a family game night night.",
    "Organize a family movie night.",
    "Write a heartfelt letter to a family member.",
    "Offer to pick up groceries for your parents or elderly relatives.",
    "Help your kids with their homework or a school project.",
    "Give your spouse a break by taking care of the kids for a day.",
    "Plan a family outing or picnic.",
    "Offer to take care of a friend’s pet while they are away.",
    "Teach your children about an important life skill.",
    "Help your siblings with a project or task.",
    "Organize a small family reunion or gathering.",
    "Spend one-on-one time with each of your children.",
    "Plan a surprise visit to your parents or grandparents.",
    "Listen attentively to a friend or family member who needs to talk.",
    "Offer to watch your friends’ kids for an evening.",
    "Create a scrapbook of family memories for your parents.",
    "Make breakfast in bed for your spouse.",
    "Read a book to your children or with them.",
    "Help a family member organize their living space.",
    "Write down and share your favorite family recipes.",
    "Plan and cook a family meal together.",
    "Give your spouse a massage after a long day.",
    "Set up a video call with distant relatives to catch up.",
    "Share your favorite book or writer with a friend.",
    "Share your favorite movie or series with a friend.",
    "Share an inspirational quote or message on social media.",
    "Offer to help a neighbor with a chore.",
    "Compliment a colleague on their work.",
    "Compliment a stranger to brighten their day.",
    "Write a positive review for a local business.",
    "Volunteer for a community service activity.",
    "Donate unused clothes to a local shelter.",
    "Donate books to a local library or school.",
    "Donate to a charity of your choice.",
    "Give a generous tip to a service worker.",
    "Buy a meal or coffee for a homeless person.",
    "Prepare a meal for someone today.",
    "Help someone with their tech troubles.",
    "Share a skill or knowledge with someone who wants to learn.",
    "Offer to run an errand for someone busy or unable to.",
    "Make a care package for someone in need.",
    "Help someone who looks lost with directions.",
    "Donate blood if you’re eligible.",
    "Smile and greet people you meet during the day.",
]
